{"meta":{"title":"Samuel Lyu's Blog","subtitle":"Notes and Scribbles","description":"Samuel Lyu's Blog - Notes and Scribbles","author":"Samuel Lyu","url":"http://samlyu.github.io"},"pages":[],"posts":[{"title":"P-N Junction & Semiconductor Devices","slug":"P-N-Junction-Semiconductor-Devices","date":"2016-07-13T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/07/14/P-N-Junction-Semiconductor-Devices/","link":"","permalink":"http://samlyu.github.io/2016/07/14/P-N-Junction-Semiconductor-Devices/","excerpt":"","text":"We have already learned something about circuit analysis, while to really build our circuits into practical ones, there’s still much more to do. A simple question is that, if we want to amplify our signals, like turning up the radio or enlarging an image, what kind of circuits should we build? Apparently simple resistors, capacitors an|d inductors cannot manage tasks like that. Therefore, we need the theory of p–n junction and some semiconductor devices. 1. P-type &amp; N-type semiconductorsWhen we are talking about “computers” and “chemical elements”, one term always comes into our minds: “Silicon“ or Si. It’s a perfect tetravalent metalloid, with 4 outermost electrons, hence it can be changed to be conductor or nonconductor easily. It is, actually, a kind of intrinsic semiconductor: It is a pure semiconductor without any significant dopant species present. In intrinsic semiconductors the number of excited electrons and the number of holes are equal. What we are going to do is doping, which means to combine our silicon with some other elements like phosphorus or Boron. This kind of doping will change the intrinsic semiconductors into doped ones. Their electrons will outnumber holes, which means they are ultimately N-type semiconductor, or their holes will outnumber electrons, which means they are ultimately P-type semiconductor. After the doping processes, we can assemble our semiconductors and make them into semiconductor devices. 2. Diode &amp; P-N Junction The simplest application of P-type &amp; N-type semiconductors should be the production of diodes. We always utilize this kind of components as lights or to indicate the directions of currents in the circuits for us. Actually the structure of a diode is exactly a p–n junction. We can imagine the electrons and holes as grains of sand with negative and positive charges. We already know from our high school physics lessons that something with a higher concentration will always diffuse themselves, and something with a lower concentration will always drift themselves, these are exactly what our “sands” will do. When we put a piece of P-type semiconductor and a piece of N-type semiconductor together, the majority carriers in these semiconductors will diffuse, and the minority carriers will drift themselves. While they meet each other on the boundary, departure of an electron from the N-side to the P-side leaves a positive donor ion behind on the N-side, and likewise the hole leaves a negative acceptor ion on the P-side. This creates an electric field that provides a force opposing the continued exchange of charge carriers. Just like the sands pile up and finally become a dam. This sand dam stop the sands, which are electrons and holes, from flowing. The sand dam is a p-n junction, or called depletion region. One of the distinct characteristics of a p-n junction is that it has forward bias and reverse bias. In forward bias, the p-type is connected with the positive terminal of a battery and the n-type is connected with the negative terminal. The external electric field will push the majority carriers into the p-n junction. This makes the depletion region, or p-n junction, narrower. Just like we lower our sand dam so that the sands can flow smoothly. Similarly, under reverse bias, the electric field in the p-n junction become stronger, just like we make a higher dam to stop the sand currents. The current formula in a p-n junction:$$\\begin{aligned} i=I_{S}(e^{\\frac{qu}{kT}}-1)=I_{S}(e^{\\frac{u}{U_{T}}}-1) \\end{aligned}$$ Where $I_{S}$ is the reverse saturation current, $q$ is the charge of an electron, $k$ is Boltzmann constant, $T$ is thermodynamic temperature. We can replace $\\frac{kT}{q}$ with $U_{T}$. When $T=300K$, $U_{T}\\approx 26mV$. Important features of a diode including the maximum forward rectified current ( $I_{FM}$ ), the maximum reverse operating voltage ( $U_{RM}$ ), cut-in voltage ( $U_{on}$ ), etc. The average $U_{on}$ of a silicon diode is about 0.7V while for a germanium diode it’s about 0.5V. There are different types of diodes, like LED, Schottky diode, Zener diode, etc. 3. Bipolar Junction Transistor ( BJT )","categories":[{"name":"EECS","slug":"EECS","permalink":"http://samlyu.github.io/categories/EECS/"},{"name":"Theories","slug":"EECS/Theories","permalink":"http://samlyu.github.io/categories/EECS/Theories/"}],"tags":[{"name":"analog-electronics","slug":"analog-electronics","permalink":"http://samlyu.github.io/tags/analog-electronics/"}]},{"title":"Electromagnetic Field: Maxwell's Equations","slug":"Electromagnetic-Field-Maxwell-s-Equations","date":"2016-03-12T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/03/13/Electromagnetic-Field-Maxwell-s-Equations/","link":"","permalink":"http://samlyu.github.io/2016/03/13/Electromagnetic-Field-Maxwell-s-Equations/","excerpt":"","text":"We have already learned something about electrostatics and magnetostatics. However these laws and formulas and equations are kind of complicated and messy. Real truths should not be something like those. They should be something like, you know, Newton’s Laws of motion. So, how can we simplify them? How can we unify them? In a paper published in 1861: On physical lines of force, James Clerk Maxwell, a great Scottish scientist, gave us his answer. The equations in his papers were later improved and perfected, and named as Maxwell’s equations. Maxwell’s equations describe how electric and magnetic fields are generated and altered by each other and by charges and currents. These equations are a set of partial differential equations that, together with the Lorentz force law, form the foundation of classical electrodynamics, classical optics, and electric circuits. Now let’s set these equations apart and give them some explanations. 1. Faraday’s Law of InductionElectromagnetic induction was discovered by Michael Faraday in 1831. Michael Faraday explained electromagnetic induction using a concept he called lines of force. However, scientists at the time widely rejected his theoretical ideas, mainly because they were not formulated mathematically. An exception was Maxwell. In Maxwell’s papers, the time-varying aspect of electromagnetic induction is expressed as a differential equation which Oliver Heaviside ( him again :-D ) referred to as Faraday’s law even though it is different from the original version of Faraday’s law, and does not describe motional electromotive force. As we already learned in high school, there are two kinds of electromotive forces, aka EMF. One is generated by the movements of coils in constant magnetic fields ( motional EMF ), this is how a dynamo works:$$\\begin{aligned} \\varepsilon=\\oint_{l}(\\vec{v}\\times\\vec{B})\\cdot d\\vec{l}=-\\oint_{l}(\\vec{B}\\times\\vec{v})\\cdot d\\vec{l} \\end{aligned}$$The other one is generated by the changing magnetic field, in which the coils are motionless ( induced EMF ), this is how a transformer works:$$\\begin{aligned} \\varepsilon=-\\frac{d\\Psi}{dt}=-\\frac{d}{dt}\\int_{S}\\vec{B}\\cdot d\\vec{S} \\end{aligned}$$There is a negative sign, because of Lenz’s law. So, altogether:$$\\begin{aligned} \\varepsilon=\\oint_{l}(\\vec{v}\\times\\vec{B})\\cdot d\\vec{l}-\\frac{d}{dt}\\int_{S}\\vec{B}\\cdot d\\vec{S} \\end{aligned}$$ We should note that electromotive forces are more essential than induced currents. Only in a conductor you can detect the induced currents, while you can get the electromotive forces on everything inside a magnetic field. The above equations are born before Maxwell had his thoughts. What Maxwell did was: he assumed that there should be a surrounding electric field generated by every changing magnetic field. This kind of electric field, called induced electric field, can take some effect on electric charges.$$\\begin{aligned} \\oint_l\\vec{E_i}\\cdot d\\vec{l}=\\oint_{l}(\\vec{v}\\times\\vec{B})\\cdot d\\vec{l}-\\frac{d}{dt}\\int_{S}\\vec{B}\\cdot d\\vec{S} \\end{aligned}$$The force lines of this kind of field are closed, not the same kind of force lines of a static electric field. Then, Maxwell imagined the situation when a static electric field, generated by a static electric charge, and an induced electric field, excited by a changing magnetic field, coexist:$$\\begin{aligned} &amp;\\oint_l\\vec{E}\\cdot d\\vec{l}=\\oint_l\\vec{E_i}\\cdot d\\vec{l}+\\oint_l\\vec{E_q}\\cdot d\\vec{l}\\\\ &amp;\\because\\oint_l\\vec{E_q}\\cdot d\\vec{l}=0\\\\ &amp;\\therefore\\oint_l\\vec{E}\\cdot d\\vec{l}=\\oint_{l}(\\vec{v}\\times\\vec{B})\\cdot d\\vec{l}-\\frac{d}{dt}\\int_{S}\\vec{B}\\cdot d\\vec{S}\\\\ &amp;\\therefore\\int_S\\nabla\\times\\vec{E}\\cdot d\\vec{S}=-\\int_S(\\frac{\\partial\\vec{B}}{\\partial t}-\\nabla\\times(\\vec{v}\\times\\vec{B}))\\cdot d{S}\\\\ &amp;\\therefore\\nabla\\times\\vec{E}=\\nabla\\times(\\vec{v}\\times\\vec{B})-\\frac{\\partial\\vec{B}}{\\partial t}\\\\ \\end{aligned}$$When the coils are not moving:$$\\begin{aligned} \\nabla\\times\\vec{E}=-\\frac{\\partial\\vec{B}}{\\partial t} \\end{aligned}$$In integral form:$$\\begin{aligned} \\oint_l\\vec{E}\\cdot d\\vec{l}=-\\int_S\\frac{\\partial\\vec{B}}{\\partial t}\\cdot d\\vec{S} \\end{aligned}$$These above two equations are the differential form and integral form of one of the four Maxwell’s equations: the Maxwell–Faraday equation. 2. Ampère’s Circuital LawThe previous equation tells us that magnetic fields can excite electric fields, now let’s consider whether electric fields can excite magnetic fields. Actually we have learned the Ampère’s circuital law in magnetostatics:$$\\begin{aligned} \\oint_{l}\\vec{H}\\cdot d\\vec{l}=I \\end{aligned}$$ However, this equation is false in some situations, like this:Here we have a plane-parallel capacitor in a circuit. If we use Ampère’s circuital law to calculate the current:Through plane $S_{1}$:$$\\begin{aligned} \\oint_{l}\\vec{H}\\cdot d\\vec{l}=\\int_{S_{1}}\\vec{J}\\cdot d\\vec{S}=I \\end{aligned}$$Through plane $S_{2}$:$$\\begin{aligned} \\oint_{l}\\vec{H}\\cdot d\\vec{l}=\\int_{S_{2}}\\vec{J}\\cdot d\\vec{S}=0 \\end{aligned}$$Apparently, the currents should be equal. How can we resolve the contradiction? Maxwell assumed that there is some kind of current passing through the capacitor, but this kind of current is not the common kind of current we can measure in a wire, it is displacement current. This kind of current is generated by a changing current, that’s why we are not aware of it if the current is steady in our circuit. Of course, fields that generate displacement currents are called electric displacement field, the same $\\vec{D}$ we used in magnetostatics. $$\\left\\{ \\begin{aligned} &amp;\\oint_{l}\\vec{H}\\cdot d\\vec{l}=\\oint_{S}(\\vec{J}+\\vec{J}_{D})\\cdot d\\vec{S}=\\oint_{S}(\\vec{J}+\\frac{\\partial \\vec{D}}{\\partial t})\\cdot d\\vec{S}\\\\ &amp;\\nabla\\times\\vec{H}=\\vec{J}+\\frac{\\partial \\vec{D}}{\\partial t}\\\\ \\end{aligned} \\right.$$ These above two equations are the integral form and differential form of one of the four Maxwell’s equations: the Maxwell–Ampère equation. 3. Maxwell’s EquationsNow we know that electric fields and magnetic fields can activate each other and Maxwell used 2 of his 4 equations to explain this. The other 2 of his equations tell us the shapes of these fields, actually they are Guass’s Law and Gauss’s law for magnetism. We have learned those before. So, as a whole, Maxwell’s equations are:$$\\left\\{ \\begin{aligned} &amp;\\nabla\\cdot\\vec{D}=\\rho_{V}\\\\ &amp;\\nabla\\cdot\\vec{B}=0\\\\ &amp;\\nabla\\times\\vec{E}=-\\frac{\\partial\\vec{B}}{\\partial t}\\\\ &amp;\\nabla\\times\\vec{H}=\\vec{J}+\\frac{\\partial\\vec{D}}{\\partial t}\\\\ \\end{aligned} \\right.$$Or:$$\\left\\{ \\begin{aligned} &amp;\\oint_{S}\\vec{D}\\cdot d\\vec{S}=Q\\\\ &amp;\\oint_{S}\\vec{B}\\cdot d\\vec{S}=0\\\\ &amp;\\oint_{l}\\vec{E}\\cdot d\\vec{l}=-\\int_{S}\\frac{\\partial\\vec{B}}{\\partial t}\\cdot d\\vec{S}\\\\ &amp;\\oint_{l}\\vec{H}\\cdot d\\vec{l}=\\oint_{S}(\\vec{J}+\\frac{\\partial\\vec{D}}{\\partial t})\\cdot d\\vec{S}=I\\\\ \\end{aligned} \\right.$$ By using these 4 equations, Maxwell simplified and unified electric fields and magnetic fields. They are all electromagnetic fields. 4. Boundary Conditions:Just like what we’ve learned in electrostatic and magnetostatics:$$\\left\\{ \\begin{aligned} &amp;\\vec{E}_{1tan}=\\vec{E}_{2tan}\\\\ &amp;\\vec{B}_{1nor}=\\vec{B}_{2nor}\\\\ &amp;\\vec{D}_{2nor}-\\vec{D}_{1nor}=\\sigma_{f}\\\\ &amp;\\vec{H}_{1tan}-\\vec{H}_{2tan}=\\vec{K}\\\\ \\end{aligned} \\right.$$ 5. The Speed of LightLet’s do something else now. First, in a vacuum, the Maxwell’s equations become:$$\\left\\{ \\begin{aligned} &amp;\\nabla\\times\\vec{H}=\\varepsilon\\frac{\\partial\\vec{E}}{\\partial t}\\\\ &amp;\\nabla\\times\\vec{E}=-\\mu\\frac{\\partial\\vec{H}}{\\partial t}\\\\ &amp;\\nabla\\cdot\\vec{H}=0\\\\ &amp;\\nabla\\cdot\\vec{E}=0\\\\ \\end{aligned} \\right.$$ Let’s calculate the curls of each side of the first equation.$$\\begin{aligned} &amp;\\nabla\\times\\nabla\\times\\vec{H}=\\nabla\\times(\\varepsilon\\frac{\\partial\\vec{E}}{\\partial t})\\varepsilon\\frac{\\partial}{\\partial t}(\\nabla\\times\\vec{E}) \\end{aligned}$$Because of the identical equation we’ve learned in vector analysis:$$\\begin{aligned} \\nabla\\times\\nabla\\times\\vec{H}=\\nabla(\\nabla\\cdot\\vec{H})-\\nabla^{2}\\vec{H} \\end{aligned}$$We can get the electromagnetic wave equation:$$\\begin{aligned} \\nabla^{2}\\vec{H}-\\mu\\varepsilon\\frac{\\partial^{2}\\vec{H}}{\\partial t^{2}}=0 \\end{aligned}$$For the same reason:$$\\begin{aligned} \\nabla^{2}\\vec{E}-\\mu\\varepsilon\\frac{\\partial^{2}\\vec{E}}{\\partial t^{2}}=0 \\end{aligned}$$Meanwhile, in our college physics class, we’ve learned the one-dimensional wave equation by analyzing the movement of a spring:$$\\begin{aligned} \\frac{\\partial^{2}y}{\\partial x^{2}}-a^{2}\\frac{\\partial^{2}y}{\\partial t^{2}}=0\\\\ (a=\\frac{1}{v}) \\end{aligned}$$Therefore, we get the speed of electromagnetic wave in a vacuum:$$\\begin{aligned} v=\\frac{1}{\\sqrt{\\mu_{0}\\varepsilon_{0}}}\\approx 3\\times 10^{8} m/s \\end{aligned}$$ Maxwell: Isn’t it just similar to the speed of light that Hippolyte Fizeau measured ?! How can this happen?! What is exactly inside a vacuum?? The results were: First, Maxwell prophesied that light is electromagnetic radiation. This was later proved to be right by Heinrich Hertz in 1888. Second, Maxwell’s thoughts facilitated the aether theories. This was later proved to be wrong by the Michelson–Morley experiment in 1880s. As for how Albert Einstein solved the problems left by aether theories by using his special relativity in 1905, that’s another long story. References: Liu,Wenkai. Electromagnetic Fields and Electromagnetic Waves. [M]. Beijing: BUPT Press, 2013. He,Xiaoxiang. Engineering Electromagnetic Field. [M]. Beijing: Publishing House of Electronics Industry, 2011. Bhag Singh Guru. Electromagnetic Field Theory Fundamentals, 2nd ed. [M]. Cambridge: Cambridge University Press, 2009. Maxwell’s Equations [EB/OL]. http://www.maxwells-equations.com/, 2016-03-25. Guokr [EB/OL]. http://www.guokr.com/i/0867078073/, 2016-03-25. Wikipedia [EB/OL]. https://en.wikipedia.org, 2016-03-25.","categories":[{"name":"EECS","slug":"EECS","permalink":"http://samlyu.github.io/categories/EECS/"},{"name":"Theories","slug":"EECS/Theories","permalink":"http://samlyu.github.io/categories/EECS/Theories/"}],"tags":[{"name":"electromagnetic-field","slug":"electromagnetic-field","permalink":"http://samlyu.github.io/tags/electromagnetic-field/"}]},{"title":"Electromagnetic Field: Magnetostatics","slug":"Electromagnetic-Field-Magnetostatics","date":"2016-03-05T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/03/06/Electromagnetic-Field-Magnetostatics/","link":"","permalink":"http://samlyu.github.io/2016/03/06/Electromagnetic-Field-Magnetostatics/","excerpt":"","text":"We have already learned something about electrostatics last times. Now we turn to focus on magnetostatics. In history, for some reasons, although magnets and magnetism were known earlier, the study of magnetism was not going smoothly. Sometimes it was almost just analogy. First we also have a Coulomb’s law:$$|\\vec{F}|=\\frac{q_1 q_2}{4\\pi\\mu_0 r^2}$$ Exactly the same equation we have in electrostatics, the differences are: vacuum permittivity is replaced by vacuum permeability, and the charges are no longer electric charges but “magnetic charges” or “magnetic poles”, aka magnetic monopoles. Later in 1824, Siméon Denis Poisson created the first successful model of the magnetic field. In this model, a magnetic $\\vec{H}$-field is produced by ‘magnetic poles’ and magnetism is due to small pairs of north/south magnetic poles. $\\vec{H}$ is magnetic field strength. We also have the following equation: $$\\vec{B}=\\mu_0(\\vec{H}+\\vec{M})$$ $\\vec{B}$ is called magnetic field strength, $\\vec{M}$ is called magnetization intensity. Just like polarization, here we have magnetization. Also, if the medium is linear and isotropic:$$\\begin{aligned} \\vec{B}=\\mu_0(\\vec{H}+\\chi_m\\vec{H})=\\mu_0 \\mu_r \\vec{H}=\\mu \\vec{H} \\end{aligned}$$If we take a look back:$$\\begin{aligned} \\vec{D}=(1+\\chi)\\varepsilon_0\\vec{E}=\\varepsilon_r\\varepsilon_0 \\vec{E}=\\varepsilon \\vec{E} \\end{aligned}$$They are TOTALLY the same. HOWEVER, those theories are all based on “magnetic poles”. Are they really exist? In 1785, Charles-Augustin de Coulomb himself experimentally verified this and stated explicitly that the north and south poles cannot be separated. So what really produces magnetic force? Three discoveries challenged this foundation of magnetism. First, in 1819, Hans Christian Ørsted discovered that an electric current generates a magnetic field encircling it. Then in 1820, André-Marie Ampère showed that parallel wires having currents in the same direction attract one another. Finally, Jean-Baptiste Biot and Félix Savart discovered the Biot–Savart law in 1820, which correctly predicts the magnetic field around any current-carrying wire. Extending these experiments, Ampère published his own successful model of magnetism in 1825. In it, he showed the equivalence of electrical currents to magnets and proposed that magnetism is due to perpetually flowing loops of current instead of the dipoles of magnetic charge in Poisson’s model. This has the additional benefit of explaining why magnetic charge can not be isolated. Further, Ampère derived both Ampère’s force law describing the force between two currents and Ampère’s law, which, like the Biot–Savart law, correctly described the magnetic field generated by a steady current. Also in this work, Ampère introduced the term electrodynamics to describe the relationship between electricity and magnetism. From our modern perspectives, unified theory is still fashionable. Ampère made a big step toward it. a). Biot–Savart LawIn a vacuum:$$\\begin{aligned} \\vec{B}=\\int d\\vec{B}=\\frac{\\mu_0}{4\\pi}\\int_{l&apos;}\\frac{I&apos;dl&apos;\\times(\\vec{r}-\\vec{r&apos;})}{|\\vec{r}-\\vec{r&apos;}|^3} \\end{aligned}$$ b). Ampère’s Circuital LawIn a vacuum:$$\\begin{aligned} \\oint\\vec{B} \\cdot d\\vec{l}=\\mu_0\\sum I \\end{aligned}$$The direction of the current is related to the direction of the $\\vec{B}$ circle, by using the right hand rule. In other mediums, we have to take magnetization into account:$$\\begin{aligned} \\oint\\vec{H}\\cdot d\\vec{l}=I \\end{aligned}$$ The relationship of $\\vec{B}$, $\\vec{H}$, and $\\vec{M}$ is correct, but we’d like to write it in a different form:$$\\begin{aligned} \\vec{H}=\\frac{\\vec{B}}{\\mu_0}-\\vec{M} \\end{aligned}$$ c). Fundamental EquationsIntegral form:$$\\left\\{ \\begin{aligned} &amp;\\oint_S \\vec{B} \\cdot d\\vec{S}=0\\\\ &amp;\\oint \\vec{H} \\cdot d\\vec{l}=I\\\\ \\end{aligned} \\right.$$Differential form:$$\\left\\{ \\begin{aligned} &amp;\\nabla \\cdot \\vec{B}=0\\\\ &amp;\\nabla \\times \\vec{H}=\\vec{J}\\\\ \\end{aligned} \\right.$$Now we know that static magnetic fields are rotational, and divergence-free. d). Magnetic PotentialNow we are going to define magnetic potential to measure the rotation of a static magnetic field, just like what we did in electric potential.$$\\vec{B}=\\nabla\\times\\vec{A}$$$$\\Psi=\\int_S \\vec{B} \\cdot d\\vec{S}=\\int_S (\\nabla \\times \\vec{A})\\cdot d\\ vec{S}=\\oint_L \\vec{A}\\cdot d\\vec{l}$$This is not enough, we also want to define magnetic scholar potential by analogy.$$\\vec{H}=-\\nabla \\varphi_m$$ e). Boundary ConditionsNear to the boundary line of two static electric fields:$$\\left\\{ \\begin{aligned} &amp;\\vec{B}_{2n}=\\vec{B}_{1n}\\\\ &amp;\\vec{H}_{1t}-\\vec{H}_{2t}=\\vec{K}\\\\ \\end{aligned} \\right.$$$\\vec{K}$ is the linear current density.Represented with magnetic potential, if the field is axisymmetric:$$\\left\\{ \\begin{aligned} &amp;\\vec{A_1}=\\vec{A_2}\\\\ &amp;\\frac{1}{\\mu_1}\\frac{\\partial \\vec{A_1}}{\\partial n}-\\frac{1}{\\mu_2}\\frac{\\partial \\vec{A_2}}{\\partial n}=\\vec{K}\\\\ \\end{aligned} \\right.$$Represented with magnetic scholar potential:$$\\left\\{ \\begin{aligned} &amp;\\varphi_{m1}=\\varphi_{m2}\\\\ &amp;\\mu_1 \\frac{\\partial \\varphi_{m1}}{\\partial n}=\\mu_2 \\frac{\\partial \\varphi_{m2}}{\\partial n}\\\\ \\end{aligned} \\right.$$ f). Basic QuestionsAlmost the same in electrostatics.How can we know the effect of a field if we already knew something about the source? How can we know something about a source if we already knew the effect of the field it excited?Answers: Biot–Savart law ( for continuous objects ). Ampère’s circuital law ( for electric wires ). Boundary conditions, along with Poisson’s equation: $\\nabla^2\\cdot\\vec{A}=-\\mu\\vec{J}$, or Laplace’s equation: $\\nabla^2\\varphi_m=0$ in vector form ( in a force-free magnetic field ). Method of images ( for different mediums ).g). EnergySelf inductance: $\\Psi=LI$ Mutual inductance: $\\Psi=MI$ For coils:$$\\begin{aligned} W_m=\\frac{1}{2}\\sum_{i=1}^{n} I_i \\Psi_i \\end{aligned}$$For magnetic bodies: $$W_m=\\frac{1}{2}\\int_V \\vec{H}\\cdot\\vec{B}dV$$ That’s all. HOWEVER… what if magnetic monopole does exist and someone finds it out? References: Liu,Wenkai. Electromagnetic Fields and Electromagnetic Waves. [M]. Beijing: BUPT Press, 2013. Wikipedia [EB/OL]. https://en.wikipedia.org, 2016-03-06.","categories":[{"name":"EECS","slug":"EECS","permalink":"http://samlyu.github.io/categories/EECS/"},{"name":"Theories","slug":"EECS/Theories","permalink":"http://samlyu.github.io/categories/EECS/Theories/"}],"tags":[{"name":"electromagnetic-field","slug":"electromagnetic-field","permalink":"http://samlyu.github.io/tags/electromagnetic-field/"}]},{"title":"Electromagnetic Field: Electrostatics","slug":"Electromagnetic-Field-Electrostatics","date":"2016-03-02T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/03/03/Electromagnetic-Field-Electrostatics/","link":"","permalink":"http://samlyu.github.io/2016/03/03/Electromagnetic-Field-Electrostatics/","excerpt":"","text":"What are we trying to figure out when we talk about a force field? What are the force lines look like? Diverging or twisting? How can we measure them? What would happen if two fields connected together? How can we know the effect of a field if we already knew something about the source? How can we know something about a source if we already knew the effect of the field it excited? How about the energy or something else? By solving the above questions no.1 we can get some fundamental equations of the field. Questions no.3 are the basic problems that we need some solutions and questions no.1 and no.2 are of help. As for question no.4, that’s something matters in practical applications. We can do those with our mathematical tools. However, every physics issue has to be started with some experiments. How much is the force? That is question no.0. Now that I cannot demonstrate all the laws and formulas myself, I am going to list some pioneer scientists’ discoveries of three kinds of basic static electromagnetic fields below, and two of them are parts of electrostatics. What I can fully understand is that, these formulas are of simplicity and elegance undoubtedly. 1. Static Electric fieldThe static electric field is produced by stationary charges, positive ones or negative ones. a). Coulomb’s LawFirst published by Charles Augustin de Coulomb in 1784.$$\\begin{aligned} \\vec{F_{1\\to 2}}=\\frac{q_{1}q_{2}}{4\\pi \\varepsilon_{0} |\\vec{r_{2}}-\\vec{r_{1}}|^2}\\hat{e_{12}}=\\frac{q_1 q_2(\\vec{r_2}-\\vec{r_1})}{4\\pi \\varepsilon_0 |\\vec{r_2}-\\vec{r_1}|^3}\\\\ \\vec{F_{2\\to 1}}=\\frac{q_{1}q_{2}}{4\\pi \\varepsilon_{0} |\\vec{r_{1}}-\\vec{r_{2}}|^2}\\hat{e_{21}}=\\frac{q_1 q_2(\\vec{r_1}-\\vec{r_2})}{4\\pi \\varepsilon_0 |\\vec{r_1}-\\vec{r_2}|^3} \\end{aligned}$$ b). Electric Field Intensity ( $\\vec{E}$ )The electric field $\\vec{E}$ at a given point is defined as the (vectorial) force $\\vec{F}$ that would be exerted on a stationary test particle of unit charge by electromagnetic forces ( i.e. the Lorentz force ). A particle of charge q would be subject to a force: $$\\vec{F}=q\\cdot\\vec{E}$$ c). Fundamental EquationsBy using the mathematical tools we obtained last time ( flux, circulation, divergence, curl ), we are able to get some fundamental equations of static electric field: Gauss’s flux theorem and circuital theorem of static electric field, in both integral form and differential form.$$\\left\\{ \\begin{aligned} &amp;\\oint_S \\vec{E}\\cdot d\\vec{S}=\\frac{Q}{\\varepsilon_0}\\\\ &amp;\\oint_L \\vec{E}\\cdot d\\vec{l}=0\\\\ \\end{aligned} \\right.$$$$\\left\\{ \\begin{aligned} &amp;\\nabla\\cdot\\vec{E}=\\frac{\\rho}{\\varepsilon_0}\\\\ &amp;\\nabla\\times\\vec{E}=0\\\\ \\end{aligned} \\right.$$ However, because of polarization, those above formulas can only be used in a vacuum, where has a simple permittivity: $\\varepsilon_0$. We have to take polarization density $\\vec{P}$ into account. We define electric displacement $\\vec{D}$ as:$$\\vec{D}=\\varepsilon_0 \\vec{E} + \\vec{P}$$( As for why it is called “displacement”, we will talk about it next time. )If the medium is not only linear but also isotropic:$$\\vec{P}=\\chi \\varepsilon_0 \\vec{E}$$$$\\vec{D}=(1+\\chi)\\varepsilon_0\\vec{E}=\\varepsilon_r\\varepsilon_0 \\vec{E}=\\varepsilon \\vec{E}$$So here are the fundamental equations (final version):$$\\left\\{ \\begin{aligned} &amp;\\oint_S \\vec{D}\\cdot d\\vec{S}=\\int_V \\rho_f dV=Q_f\\\\ &amp;\\oint_L \\vec{E}\\cdot d\\vec{l}=0\\\\ \\end{aligned} \\right.$$$$\\left\\{ \\begin{aligned} &amp;\\nabla\\cdot\\vec{D}=\\rho_f\\\\ &amp;\\nabla\\times\\vec{E}=0\\\\ \\end{aligned} \\right.$$ Now we have already known about the force and what the force lines look like: The static electric field is an irrotational field. d). Electric PotentialSince the curl of a static electric field equals to zero, we can define a variable to measure the divergence of the field. Imagine a waterfall, we now know the velocity of the water, how can we get the height of each point in this “waterfall field”? BTW, we want the height of ground remain zero.$$\\vec{E}=-\\nabla\\varphi$$ e). Boundary ConditionsNear to the boundary line of two static electric fields:$$\\left\\{ \\begin{aligned} &amp;\\vec{E}_{1t}=\\vec{E}_{2t}\\\\ &amp;\\vec{D}_{2n}-\\vec{D}_{1n}=\\sigma_f\\\\ \\end{aligned} \\right.$$Represented with electric potential:$$\\left\\{ \\begin{aligned} &amp;\\varphi_1=\\varphi_2\\\\ &amp;\\varepsilon_2\\frac{\\partial\\varphi_2}{\\partial n}-\\varepsilon_1\\frac{\\partial\\varphi_1}{\\partial n}=-\\sigma_f\\\\ \\end{aligned} \\right.$$If both of the mediums are linear and isotropic, here we have the law of reflection:$$\\frac{tan\\alpha_1}{tan\\alpha_2}=\\frac{\\varepsilon_1}{\\varepsilon_2}$$ f). Basic QuestionsHow can we know the effect of a field if we already knew something about the source? How can we know something about a source if we already knew the effect of the field it excited?Answers: Coulomb’s law and $\\vec{E}$. Coulomb’s law and $\\vec{E}$ and integration ( for continuous objects ). Gauss’s flux theorem ( for symmetrical objects ). Boundary conditions, along with Poisson’s equation: $\\nabla^2\\varphi=-\\frac{\\rho_f}{\\varepsilon}$, or Laplace’s equation: $\\nabla^2\\varphi=0$. Method of image charges ( for different mediums ). g). EnergySeparated charges:$$\\begin{aligned} &amp;W=\\frac{1}{2}\\sum^{n}_{i=1} q_i \\varphi_i\\\\ &amp;\\varphi_i=\\sum^{n}_{j=1,j\\neq i}\\varphi_{ij}\\\\ \\end{aligned}$$Continuous charged body:$$W=\\frac{1}{2}\\int_V \\rho\\varphi dV=\\frac{1}{2}\\int_V \\vec{D}\\cdot\\vec{E}dV$$ 2. Steady Electric FieldWe now know what would happen if we have some stationary charges. Next, we want to make them move, say, in a circuit. Although they are moving, the distribution of the charges is invariable. In that situation, we get a steady electric field. a). Current DensityWe can no longer regard currents as constants now. Current density is defined as a vector whose magnitude is the electric current per cross-sectional area at a given point in space.$$\\begin{aligned} &amp;\\vec{J}=\\rho \\vec{\\nu}\\\\ &amp;I=\\int_S \\vec{J}\\cdot d\\vec{S}\\\\ \\end{aligned}$$ b). Ohm’s Law: Differential FormIf the medium is linear and isotropic:$$\\begin{aligned} \\vec{J}=\\gamma\\vec{E} \\end{aligned}$$$\\gamma$ is the electrical conductivity of the medium. c). KCL: Integral &amp; Differential FormWe have already learned that the quantity of electric charges is conserved. Let’s consider a section of a electric wire. The current discharging from the section should equals to the decrement rate of charges.$$\\left\\{ \\begin{aligned} &amp;\\oint_S \\vec{J}\\cdot d\\vec{S}=-\\int_V \\frac{\\partial\\rho}{\\partial t}dV\\\\ &amp;\\nabla \\cdot \\vec{J}=-\\frac{\\partial\\rho}{\\partial t}\\\\ \\end{aligned} \\right.$$The above equations are appropriate for any electric field. As for steady electric field, the equations become:$$\\left\\{ \\begin{aligned} &amp;\\oint_S \\vec{J}\\cdot d\\vec{S}=0\\\\ &amp;\\nabla \\cdot \\vec{J}=0\\\\ \\end{aligned} \\right.$$ d). Fundamental EquationsSteady electric fields are not only irrotational, but also divergence-free.Integral form:$$\\left\\{ \\begin{aligned} &amp;\\oint_S \\vec{J}\\cdot d\\vec{S}=0\\\\ &amp;\\oint_l \\vec{E}\\cdot d\\vec{l}=0\\\\ \\end{aligned} \\right.$$Differential form:$$\\left\\{ \\begin{aligned} \\nabla \\cdot \\vec{J}=0\\\\ \\nabla \\times \\vec{E}=0\\\\ \\end{aligned} \\right.$$ e). Boundary ConditionsNear to the boundary line of two steady electric fields:$$\\left\\{ \\begin{aligned} &amp;\\vec{E}_{1t}=\\vec{E}_{2t}\\\\ &amp;\\vec{J}_{1n}=\\vec{J}_{2n}\\\\ \\end{aligned} \\right.$$Represented with electric potential:$$\\left\\{ \\begin{aligned} &amp;\\varphi_1=\\varphi_2\\\\ &amp;\\gamma_1\\frac{\\partial\\varphi_1}{\\partial n}=\\gamma_2\\frac{\\partial\\varphi_2}{\\partial n}\\\\ \\end{aligned} \\right.$$If both of the mediums are linear and isotropic, here we have the law of reflection:$$\\frac{tan\\alpha_1}{tan\\alpha_2}=\\frac{\\gamma_1}{\\gamma_2}$$ That’s all… The calculations are quite exhausting. However, you can see the artistry. References: Liu,Wenkai. Electromagnetic Fields and Electromagnetic Waves. [M]. Beijing: BUPT Press, 2013. Wikipedia [EB/OL]. https://en.wikipedia.org, 2016-03-05.","categories":[{"name":"EECS","slug":"EECS","permalink":"http://samlyu.github.io/categories/EECS/"},{"name":"Theories","slug":"EECS/Theories","permalink":"http://samlyu.github.io/categories/EECS/Theories/"}],"tags":[{"name":"electromagnetic-field","slug":"electromagnetic-field","permalink":"http://samlyu.github.io/tags/electromagnetic-field/"}]},{"title":"Electromagnetic Field: Vector Analysis","slug":"Electromagnetic-Field-Vector-Analysis","date":"2016-02-03T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/02/04/Electromagnetic-Field-Vector-Analysis/","link":"","permalink":"http://samlyu.github.io/2016/02/04/Electromagnetic-Field-Vector-Analysis/","excerpt":"","text":"$$\\begin{aligned} &amp; Principle\\;No.1:\\\\ &amp; Simplicity\\;is\\;the\\;ultimate\\;sophistication.\\\\ &amp; ---\\;Leonardo\\;Da\\;Vinci \\end{aligned}$$ An electromagnetic field (also EMF or EM field) is a physical field produced by electrically charged objects. It affects the behavior of charged objects in the vicinity of the field. Just like that you are a person with some mass (or weight), let’s say 130 lbs (I’m sorry if you are much heavier than that), you will produce a gravity field and the sun will be dragged a little bit nearer to you. Actually the EMF works just like that, but a little bit different. The electromagnetic field extends indefinitely throughout space and describes the electromagnetic interaction. It is one of the four fundamental forces of nature (the others are gravitation, weak interaction and strong interaction). If you are interested in these forces especially the latter two, I highly recommend Dr.Leon Lederman’s book: The God Particle. While here we only focus our eyes on the EMF, and in classical physics: we just think the EMF as a smooth, continuous field. The field can be viewed as the combination of an electric field and a magnetic field. The electric field is produced by stationary charges, and the magnetic field by moving charges (currents); these two are often described as the sources of the field. The way in which charges and currents interact with the electromagnetic field is described by Maxwell’s equations and the Lorentz force law. Actually the Maxwell’s equations are the destinations of this lesson here… 1. Vector Field: Flux &amp;&amp; CirculationWhat are we talking about when we talk about a vector field? How can we describe a vector field in a visualized way? “Field line.” Said Michael Faraday. Faraday: See? those bits of iron around the bar magnet proved me right. :) Very good indeed… but not precise enough. These visible lines are just a small part of the infinite lines excited by the sources of these fields. Maybe a more mathematical way is better. Actually, if we classify these force lines, there are two kinds: one is divergent, the other is vortical. In fact, when we are “measuring” a vector field, the proper mathematical way is exactly to “count” how “many” force lines are going through an infinitesimal surface ( flux ) &amp;&amp; running along an infinitesimal closed curve ( circulation ). Apparently, if we take physical truth into account, these infinitesimal surfaces and infinitesimal closed curves must have directions. For example, if our surface is a closed surface which surrounds the source of our field, say, a positive charge, so we have to orient the surface with a normal vector pointing always outwards. Another example: if our source is at the center of our closed curve, we have to use the almighty right-hand rule to judge the positive direction of our curve. Here are the definitions: Let’s assume that we have a “spring water source”, the water is incompressible and its density is 1. The velocity field of the “spring water” is $\\vec{v}(x,y,z)$, where: $$\\vec{V}(x,y,z)=P(x,y,z)\\vec{i}+Q(x,y,z)\\vec{j}+R(x,y,z)\\vec{k}$$So:Flux:$$\\begin{aligned} \\Phi=\\int_{\\Omega}\\vec{V}d\\vec{S}=\\iint_{\\Sigma}\\vec{V}\\cdot\\vec{n}dS=\\iint_{\\Sigma}(Pcos\\alpha + Qcos\\beta + Rcos\\gamma)dS \\end{aligned}$$If $\\Sigma$ is a closed surface and its normal outward vector’s direction is its positive direction, then:$$\\begin{aligned} \\Phi=\\iint_{\\Sigma}Pdydz+Qdzdx+Rdxdy \\end{aligned}$$ If $\\Phi&gt;0$, then there is a equivalent positive source inside. If $\\Phi&lt;0$, then there is a equivalent negative source inside. If $\\Phi=0$, then there is equivalently no source inside. Circulation:$$\\begin{aligned} \\Gamma=\\oint_{L}\\vec{V}d\\vec{l}=\\oint_{L}\\vec{V}\\cdot\\vec{\\tau}ds=\\oint_{L}(Pcos\\lambda+Qcos\\mu+Rcos\\nu)ds \\end{aligned}$$Now we can describe a vector field in integral form. 2. Vector Operators, Divergence &amp;&amp; CurlNow let’s think of differentiation. Don’t you think vector field is a perfect stage for differentiation? Maybe differentiation was born for it, isn’t it Sir Newton? According to Gauss’s theorem:$$\\begin{aligned} \\Phi=\\iiint_{\\Omega}(\\frac{\\partial P}{\\partial x}+\\frac{\\partial Q}{\\partial y}+\\frac{\\partial R}{\\partial z})dxdydz \\end{aligned}$$If we shrink our surface $\\Sigma$ until it becomes an infinitesimal point.$$\\begin{aligned} \\lim_{\\Omega\\to M}\\frac{\\Phi}{V}=\\lim_{\\Omega\\to M}\\frac{1}{V}\\iiint_{\\Omega}(\\frac{\\partial P}{\\partial x}+\\frac{\\partial Q}{\\partial y}+\\frac{\\partial R}{\\partial z})dxdydz=(\\frac{\\partial P}{\\partial x}+\\frac{\\partial Q}{\\partial y}+\\frac{\\partial R}{\\partial z})_{M} \\end{aligned}$$This is the divergence of the vector field. It’s a little bit too inconvenient to write something like $(\\frac{\\partial P}{\\partial x}+\\frac{\\partial Q}{\\partial y}+\\frac{\\partial R}{\\partial z})_{M}$, so we use a vector operator to rewrite these formulas.$$\\begin{aligned} div\\vec{V}=\\frac{\\partial P}{\\partial x}+\\frac{\\partial Q}{\\partial y}+\\frac{\\partial R}{\\partial z}=\\nabla\\cdot\\vec{V} \\end{aligned}$$ Now let’s come to curl ( or vorticity ). According to Stokes’ theorem:$$\\begin{aligned} \\Gamma=\\iint_{\\Sigma}(\\frac{\\partial R}{\\partial y}-\\frac{\\partial Q}{\\partial z})dydz+(\\frac{\\partial P}{\\partial z}-\\frac{\\partial R}{\\partial x})dzdx+(\\frac{\\partial Q}{\\partial x}-\\frac{\\partial P}{\\partial y})dxdy \\end{aligned}$$So, the vector $(\\frac{\\partial R}{\\partial y}-\\frac{\\partial Q}{\\partial z},\\frac{\\partial P}{\\partial z}-\\frac{\\partial R}{\\partial x},\\frac{\\partial Q}{\\partial x}-\\frac{\\partial P}{\\partial y})$ is defined as the curl of the vector field. It’s really hard to be memorized， isn’t it? Fortunately we have already learned some linear algebra.$$\\begin{aligned} &amp; curl\\vec{V}=(\\frac{\\partial R}{\\partial y}-\\frac{\\partial Q}{\\partial z},\\frac{\\partial P}{\\partial z}-\\frac{\\partial R}{\\partial x},\\frac{\\partial Q}{\\partial x}-\\frac{\\partial P}{\\partial y})\\\\ &amp; = \\left|\\begin{array}{cccc} \\vec{i} &amp; \\vec{j} &amp; \\vec{k} \\\\ \\frac{\\partial}{\\partial x} &amp; \\frac{\\partial}{\\partial y} &amp; \\frac{\\partial}{\\partial z}\\\\ P &amp; Q &amp; R \\end{array}\\right| =\\nabla\\times\\vec{V} \\end{aligned}$$WELL DONE :) 3. Scalar Field: GradientNow let’s look back to scalar field. Much easier aren’t they? In fact, a scalar field is just like a mountain, different places ( coordinates ) have different heights ( coordinate values ). So if we are on the top of the mountain, what really matters to us is in which directions can we get the top speed to get down the mountain ( maybe rolling down the mountain :) ), and what is the speed? Sir Issac Newton has told us how to get the answer: derivation! Gradient:$$\\begin{aligned} gradf=\\frac{\\partial f}{\\partial x}\\vec{i}+\\frac{\\partial f}{\\partial y}\\vec{j}+\\frac{\\partial f}{\\partial z}\\vec{k}=\\nabla f \\end{aligned}$$ 4. Some Special Vector Fields &amp;&amp; Helmholtz’s Theorem &amp;&amp; Two FormulasWhat would happen if the divergence or curl of a vector field equal to zero? If $\\nabla\\cdot\\vec{V}=0$, there is no “diverging source” inside the field. Actually, no electric charges. If $\\nabla\\times\\vec{V}=0$,then there is no “helical source” inside the field. Actually, no electric currents. And Helmholtz’s theorem tells us why are these 3 values: gradient, divergence and curl, so important. Because arbitrary vector field $\\vec{F}(\\vec{r})$ can be described like this:$$\\begin{aligned} \\vec{F}(\\vec{r})=-\\nabla u(\\vec{r})+\\nabla\\times\\vec{A}(\\vec{r}) \\end{aligned}$$ Also, here are two important formulas:$$\\begin{aligned} \\nabla\\times\\nabla u = 0\\\\ \\nabla\\cdot(\\nabla\\times\\vec{A})=0 \\end{aligned}$$ You can understand these formulas by imagining the force lines. 5. Summary Integral form: flux, circulation; Differential form: divergence, curl, gradient. Later, we will use these mathematical tools to analysis EMF. BY THE WAY, the calculation formulas of gradient, curl and gradient above are just appropriate for rectangular coordinate system. In other system like spherical coordinate system or cylindrical coordinate system, the formulas are different. References: Liu,Wenkai. Electromagnetic Fields and Electromagnetic Waves. [M]. Beijing: BUPT Press, 2013. Department of Mathematics, Tongji University, Advanced Mathematics, 6th ed. [M]. Beijing: Higher Education Press, 2007. Wikipedia [EB/OL]. https://en.wikipedia.org, 2016-02-09.","categories":[{"name":"EECS","slug":"EECS","permalink":"http://samlyu.github.io/categories/EECS/"},{"name":"Theories","slug":"EECS/Theories","permalink":"http://samlyu.github.io/categories/EECS/Theories/"}],"tags":[{"name":"electromagnetic-field","slug":"electromagnetic-field","permalink":"http://samlyu.github.io/tags/electromagnetic-field/"}]},{"title":"Birthday Again","slug":"Birthday-Again","date":"2016-01-30T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/01/31/Birthday-Again/","link":"","permalink":"http://samlyu.github.io/2016/01/31/Birthday-Again/","excerpt":"","text":"Birthday again - It’s my 20th.I’d like to share this song with you. Alternative link form YouTube:Comfortably Numb - Pink Floyd - The Wall (better sound n image) The child is grownThe dream is gone…I have become comfortably numbSince high school, I have been feeling like this.And now, There is no pain you are recedingYou taught me this. Others are always of higher level. They are smarter. They are stronger. They are talented. They are skillful. They are sharp. I dared not to speak. I was afraid of facing awkward situations: I was “of nonchalance”. My failure of the College Entrance Exam seemed reasonable. I was learning bad. I deserved that. I caught a fleeting glimpseOut of the corner of my eyeNow my future is unfolding. In this low-ranked college I am facing opportunities and frustrations. Disappointment is unavoidable, while the future is still appealing to me. What is happening in 3 years? A distant ship, smoke on the horizonHappy birthday to myself again. And good day to you all. P.S. Enjoy the guitar solo.","categories":[{"name":"About","slug":"About","permalink":"http://samlyu.github.io/categories/About/"}],"tags":[{"name":"miscellaneous","slug":"miscellaneous","permalink":"http://samlyu.github.io/tags/miscellaneous/"}]},{"title":"Circuit Analysis Pt.3","slug":"Circuit-Analysis-Pt-3","date":"2016-01-28T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/01/29/Circuit-Analysis-Pt-3/","link":"","permalink":"http://samlyu.github.io/2016/01/29/Circuit-Analysis-Pt-3/","excerpt":"","text":"We have already solve simple DC resistive circuit problems and sinusoidal AC circuit problems ( in Circuit Analysis Pt.1 &amp;&amp; Circuit Analysis Pt.2 ), now we need some ultimate mathematical tricks to solve all the circuit problems with periodic voltage sources and aperiodic voltage sources. 1. Fourier Series A Fourier series is a way to represent a wave-like function as the sum of simple sine waves. More formally, it decomposes any periodic function or periodic signal into the sum of a (possibly infinite) set of simple oscillating functions, namely sines and cosines (or, equivalently, complex exponentials). The Fourier series is named in honor of Jean-Baptiste Joseph Fourier (1768–1830), who made important contributions to the study of trigonometric series, after preliminary investigations by Leonhard Euler, Jean le Rond d’Alembert, and Daniel Bernoulli. Definition:$f(x)$ is a continuous periodic function. $2l$ is its period length.$$\\begin{aligned} f(x)=\\frac{a_0}{2}+\\sum_{n=1}^{\\infty}(a_{n} cos \\frac{n \\pi x}{l}+b_{n} sin \\frac{n \\pi x}{l}) \\end{aligned}$$Where:$$\\left\\{ \\begin{aligned} a_{n}=\\frac{1}{l}\\int_{-l}^{l}f(x)cos \\frac{n \\pi x}{l} dx\\\\ b_{n}=\\frac{1}{l}\\int_{-l}^{l}f(x)sin \\frac{n \\pi x}{l} dx\\\\ \\end{aligned} \\right.$$Now we can use phasor method and superposition theorem to solve these circuit problems. 2. Laplace Transform - The Theorem Integral transform: In mathematics, an integral transform is any transform $T$ of the following form:$$\\begin{aligned} (Tf)(u)=\\int_{t_1}^{t_2}K(t,u)f(t)dt \\end{aligned}$$The input of this transform is a function $f$ of the independent variable $t$, and the output is another function $Tf$ of the independent variable $u$. An integral transform is a particular kind of mathematical operator. Of course we also need an inverse transform to get the function back:$$\\begin{aligned} f(t)=\\int_{u_1}^{u_2}K^{-1}(u,t)(Tf)(u)du \\end{aligned}$$Actually, this started with J.Fourier. (why always him?) If you make $l\\to +\\infty$, the Fourier series becomes a integral form equation.$$\\begin{aligned} f(t)=\\frac{1}{\\pi}\\int_{0}^{+\\infty}d\\omega \\int_{-\\infty}^{\\infty}f(u)cos\\omega(u-t)du \\end{aligned}$$And according to Euler’s equation, we get Fourier transform:$$\\begin{aligned} F(\\omega)=\\int_{-\\infty}^{+\\infty}f(t)e^{-j\\omega t}dt\\\\ f(t)=\\frac{1}{2\\pi}\\int_{-\\infty}^{+\\infty}F(\\omega)e^{j\\omega t}d\\omega \\end{aligned}$$However, this transform is not so good to be used: As for $f(t)$, we don’t care what happen when $t&lt;0_{-}$. As for $\\omega$, it is actually the imaginary part of $j\\omega$, so what we get from Fourier transform is actually a function of a pure imaginary variable but not a function of a complex variable, which is what we need in circuit analysis. In 1785, P.Laplace got his transform: Laplace transform. It takes a function of a positive real variable t (often time) to a function of a complex variable s (often frequency). Actually this function is some kind of “improved edition” of Fourier transform. It specifically solved the 2 problems above. Definition:$$\\begin{aligned} F(s)=\\int_{0}^{+\\infty}f(t)e^{-st}dt\\\\ f(t)=\\frac{1}{2 \\pi j}\\int_{\\sigma-j\\infty}^{\\sigma+j\\infty}F(s)e^{st}ds \\end{aligned}$$Where:$$\\begin{aligned} s=\\sigma+j\\omega \\end{aligned}$$ Well, this time it is good enough… but how can we use it in solving circuit problems? Actually, not until more than 100 years later has someone thought of using this Laplace’s method in solving circuit problems. While when someone started using this way to do circuits, he couldn’t proof that it was correct because he simply found this method out of his intuition without knowing that Laplace had proved it for him more than 100 years ago. How pathetic they were! 3. Laplace Transform - Heaviside’s Contributions Oliver Heaviside (1850-1925) was a self-taught genius in electrical engineering who made many important contributions in the field. However, he was best known to engineers for his operational calculus, a tool for solving linear differential equations with constant coefficients, which he discovered around the turn of the century and which was popularized by Steinmetz in the United States. For example, he defined such operators:$$\\begin{aligned} p=\\frac{d(*)}{dt}\\\\ \\frac{1}{p}=\\int_{-\\infty}^{t}(*)dt \\end{aligned}$$In this way, a differential equation like this: $r’’+6r’+5r=e’+3e$ can be written as:$$\\begin{aligned} (p+1)(p+5)r=(p+3)e \\end{aligned}$$So integral operations and differential operations become multiplications and divisions. It is much easier. The operational calculus was severely limited by its lack of mathematical theory, which not only limited its field of application, but also created many uncertainties and ambiguities. Actually Laplace transform was the mathematical theory Heaviside needed, but it was a mathematical obscurity in his time. Sorry for Mr.Heaviside. :( 4. Laplace Transform - ApplicationsFrom time domain to frequency domain: a). Ohm’s Law:$$\\begin{aligned} U=I\\times R \\Rightarrow U(s)=I(s)R \\end{aligned}$$ b). VCRs of R, L and C: Resistors:$$\\begin{aligned} \\mathcal{L}\\{resistor\\}=R=r \\end{aligned}$$ Inductors:$$\\begin{aligned} &amp;\\because u(t)=L\\frac{di}{dt}\\\\ &amp;\\therefore U(s)=sLI(s)-Li(0_{-})\\\\ &amp;\\therefore \\mathcal{L}\\{inductor\\}=sL \\end{aligned}$$ Capacitors:$$\\begin{aligned} &amp;\\because i(t)=C\\frac{du}{dt}\\\\ &amp;\\therefore u(t)=\\frac{1}{C}\\int_{t_0}^{+\\infty}i(t)dt\\\\ &amp;\\therefore U(s)=\\frac{1}{sC}I(s)+\\frac{u(0_{-})}{s}\\\\ &amp;\\therefore \\mathcal{L}\\{capacitor\\}=\\frac{1}{sC} \\end{aligned}$$ It’s worth noting that the transformed form of capacitors and inductors is not only related to C and L but also in relation to the initial values of voltages or currents. c). Laplace transform of some important kinds of drive signals: Impulse function (Dirac delta function):$$\\begin{aligned} &amp; f(t)=\\delta(t) \\Rightarrow F(s)=1\\\\ &amp; f(t)=\\delta^{n}(t) \\Rightarrow F(s)=s^n \\end{aligned}$$ Unit step function (Heaviside step function):$$\\begin{aligned} &amp; f(t)=\\varepsilon(t) \\Rightarrow F(s)=\\frac{1}{s} \\end{aligned}$$ Some polynomial functions:$$\\begin{aligned} &amp; f(t)=t \\Rightarrow F(s)=\\frac{1}{s^2}\\\\ &amp; f(t)=t^n , n\\in \\mathbb{N}_{+} \\Rightarrow F(s)=\\frac{n!}{s^{n+1}}\\\\ \\end{aligned}$$ Exponential functions and trigonometric functions:$$\\begin{aligned} &amp; f(t)=e^{-at} \\Rightarrow F(s)=\\frac{1}{s+a}\\\\ &amp; f(t)=t^{n}e^{-at} , n\\in \\mathbb{N}_{+} \\Rightarrow F(s)=\\frac{n!}{(s+a)^{n+1}}\\\\ &amp; f(t)=sin\\omega t \\Rightarrow F(s)=\\frac{\\omega}{s^2+\\omega^2}\\\\ &amp; f(t)=cos\\omega t \\Rightarrow F(s)=\\frac{s}{s^2+\\omega^2}\\\\ &amp; f(t)=e^{-at}sin(\\omega t+\\phi) \\Rightarrow F(s)=\\frac{(s+a)sin\\phi+\\omega cos\\phi}{(s+a)^2+\\omega^2}\\\\ &amp; f(t)=e^{-at}cos(\\omega t+\\phi) \\Rightarrow F(s)=\\frac{(s+a)cos\\phi-\\omega sin\\phi}{(s+a)^2+\\omega^2} \\end{aligned}$$ If you need more, check this out: Rapidtables: Laplace Transform. d). Heaviside Cover-up MethodThe inverse transform of Laplace transform seems to be too complicated, so O. Heaviside taught us his “empirical” method, actually also some tricks to deal with differential equations just like his “operational calculus”: Heaviside cover-up method. FINALLY…That’s all: DC resistive circuits: Ohm’s law, Kirchhoff’s circuit laws, Thévenin’s theorem. Periodic AC circuits: Phasor method, Fourier series, superposition theorem. ANY circuit: Laplace transform.…I need a nap… References: Li,Hansun. Basis of Circuit Analysis, 4th ed. [M]. Beijing: Higher Education Press, 2007. Lin,Chunying. Electric Circuits and Magnetic Circuits, 2nd ed. [M]. Beijing: China Electric Power Press, 2014. Department of Mathematics, Tongji University, Advanced Mathematics, 6th ed. [M]. Beijing: Higher Education Press, 2007. Song,Suluo. Complex Function and Integral Transform. [M]. Beijing: Science Press, 2013. Calvert,James. Heaviside, Laplace and the Inversion Integral [EB/OL]. http://mysite.du.edu/~jcalvert/math/laplace.htm, 2016-01-30. Miller,James. Methods of Finding Laplace Transforms and Inverse Transforms, etc. [EB/OL]. http://www.solitaryroad.com/c913.html, 2016-01-31. Wikipedia [EB/OL]. https://en.wikipedia.org, 2016-01-31. Wikibooks [EB/OL]. https://en.wikibooks.org/wiki/Main_Page, 2016-01-31. Rapidtables [EB/OL]. http://rapidtables.com/, 2016-01-31.","categories":[{"name":"EECS","slug":"EECS","permalink":"http://samlyu.github.io/categories/EECS/"},{"name":"Theories","slug":"EECS/Theories","permalink":"http://samlyu.github.io/categories/EECS/Theories/"}],"tags":[{"name":"circuit-analysis","slug":"circuit-analysis","permalink":"http://samlyu.github.io/tags/circuit-analysis/"}]},{"title":"Circuit Analysis Pt.2","slug":"Circuit-Analysis-Pt-2","date":"2016-01-27T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/01/28/Circuit-Analysis-Pt-2/","link":"","permalink":"http://samlyu.github.io/2016/01/28/Circuit-Analysis-Pt-2/","excerpt":"","text":"Last time in Circuit Analysis Pt.1 we have got the methods to solve all the problems of DC resistive circuits, now we want to know how to solve All the circuits problems in some linear methods. Apparently the differential equations are not linear, so if we want to make them linear, we have to change the equations into some other “forms”, into some other “domains”. We have to do some mathematical tricks. Here is an example: if we want to solve the following problem:$$x^{2.35}=5$$ We cannot do it directly, so we take the log of the both sides of the function:$$2.35lg(x)=lg5$$In the “log domain”, the function becomes linear.$$lg(x)=\\frac{lg5}{2.35}\\approx\\frac{0.6989}{2.35}\\approx0.2974$$ And then we check the logarithm table:$$x=lg^{-1}0.2974\\approx1.983$$ That’s the answer. Let’s do the same thing “ELECTRONICALLY”. 1. Phasor Method First lets assume that our power sources are some AC sources.In 1748, L.Euler proved the function below:$$e^{i\\phi}=cos\\phi+isin\\phi$$Of course this function has a well-known version: Euler’s Equation:$$e^{i\\pi}+1=0$$In 1893, C.Steinmetz use this function developed his AC steady state circuit theory, he use this function to turn all the sinusoidal quantities into complex numbers: phase vectors (phasor). In this way, the VCRs of R, L, C are all linear. $$\\dot{U_m}=R\\dot{I_m}$$$$\\dot{U_m}=\\frac{1}{j\\omega C}\\dot{I_m}$$$$\\dot{U_m}=j\\omega L\\dot{I_m}$$Now the R, L, C become the same kind of linear quantity - impedance. We can use KVL or KCL or Thevenin’s theorem to solve the problems, just like what we did in the old days. Don’t forget to turn these phasors into sinusoidal quantities in the end, because these phasors actually don’t have any physical meanings. 2. Voltage Triangle and Power TriangleNow you may have found that the voltages across R, L, C have different angles. That make the voltages in an AC circuit are shaped into a “voltage triangle” in the complex plane. And think about the Power, the “U”s simply become “P”s, that’s still a triangle: the power triangle. The real part of $U_{RLC}$ is consist of $U_{R}$, that explains that resistors are thecomponents in the circuits that consume energy. The imaginary part of $U_{RLC}$ is made of $U_{C}$ and $U_{L}$, that explains that capacitors and inductors simply “charge” the energy into other forms (electric field and magnetic field) and then they can get the energy back, they don’t really consume energy. So we give $P$, $P_{real}$ and $P_{img}$ names: complex power ($\\dot{S}$), active power or real power (P), and wattless power or reactive power (Q). The length of complex power is called apparent power (S). 3. ResonanceAnother interesting fact you may have found here is that the angles of $U_{L}$ and $U_{C}$ are just the opposite: $90^\\circ$ and $-90^\\circ$. So what happened if they offset each other? Just like there are only resistors in the AC circuit. This is called resonance. This will happen when: $|j\\omega L|=|\\frac{1}{j\\omega C}|$ , so: $\\omega_{0}=\\frac{1}{\\sqrt{LC}}$. This means that resonance just happens when the circuit reaches particular frequency.Here are some other definitions: Quality Factor:$$\\begin{aligned} Q=\\frac{\\omega_{0} L}{R}=\\frac{1}{\\omega_{0} RC} \\end{aligned}$$ Bandwidth:$$\\begin{aligned} BW=\\omega_{high} - \\omega_{low}= \\frac{R}{L}=\\frac{\\omega_{0}}{Q} \\end{aligned}$$ 4. Maximum Power Transfer TheoremWe have already solved the same problem in DC circuits by using Jacobi’s Law. There are just something slightly different in AC circuits: the impedance has a imaginary part. So let’s just offset this part.$$\\begin{aligned} Z_{L}=Z^{*}_{S}\\\\ P_{Lmax}=\\frac{U^2_{S}}{4R_{S}} \\end{aligned}$$ HOWEVER, if you cannot change the angle of your load, then $Z_{L}=Z_{S}$ is good enough. 5. Circuits with Mutual InductanceInductors are interesting components. One inductor can deposit the energy into magnetic field and then another one can withdraw the energy: the transformer. Actually, we can use some calculation to get the equivalent forms of transformers or coupled inductors to turn them into some independent components in the circuits. VCR of coupled inductors:$$\\begin{aligned} u1=L_{1}\\frac{di_1}{dt}+M\\frac{di_2}{dt}\\\\ u2=L_{2}\\frac{di_2}{dt}+M\\frac{di_1}{dt} \\end{aligned}$$ And in phasor form: $$\\begin{aligned} \\dot{U_1}=j\\omega L_1 \\dot{I_1}+j\\omega M \\dot{I_2}\\\\ \\dot{U_2}=j\\omega L_2 \\dot{I_2}+j\\omega M \\dot{I_1} \\end{aligned}$$ The two dots in the circuit are dotted terminals, they show the direction of currents (actually the twining directions of the wires). If the dotted terminal on one side change, the functions above also change.$$\\begin{aligned} u1=L_{1}\\frac{di_1}{dt}-M\\frac{di_2}{dt}\\\\ u2=L_{2}\\frac{di_2}{dt}-M\\frac{di_1}{dt} \\end{aligned}$$ Other definitions: Coupling coefficient:$$\\begin{aligned} M=k\\sqrt{L_{1}L_{2}} \\end{aligned}$$ k is the coupling coefficient and 0 ≤ k ≤ 1. T-shaped inductors equivalent transform: Reflected impedance:Input impedance:$$\\begin{aligned} Z_{i}=\\frac{\\dot{U_{s}}}{\\dot{I_1}}=Z_{primary coil}+\\frac{\\omega^2 M^2}{Z_{secondary coil}} \\end{aligned}$$ $\\frac{\\omega^2 M^2}{Z_{secondary coil}}$ is called reflected impedance. Ideal transformers:Just the voltages across these two inductors change, so it can be solved normally.Mmmm, that’s all about the phasor method I’ve learned so far. However…Phasor can only solve AC circuit problems. Is there a more generally applicable linear method to solve ALL the circuit problems?? References: Li,Hansun. Basis of Circuit Analysis, 4th ed. [M]. Beijing: Higher Education Press, 2007. Lin,Chunying. Electric Circuits and Magnetic Circuits, 2nd ed. [M]. Beijing: China Electric Power Press, 2014. Wikipedia [EB/OL]. https://en.wikipedia.org, 2016-01-28.","categories":[{"name":"EECS","slug":"EECS","permalink":"http://samlyu.github.io/categories/EECS/"},{"name":"Theories","slug":"EECS/Theories","permalink":"http://samlyu.github.io/categories/EECS/Theories/"}],"tags":[{"name":"circuit-analysis","slug":"circuit-analysis","permalink":"http://samlyu.github.io/tags/circuit-analysis/"}]},{"title":"Circuit Analysis Pt.1","slug":"Circuit-Analysis-Pt-1","date":"2016-01-23T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/01/24/Circuit-Analysis-Pt-1/","link":"","permalink":"http://samlyu.github.io/2016/01/24/Circuit-Analysis-Pt-1/","excerpt":"","text":"Circuit analysis is the process of finding the voltages across, and the currents through, of every component in the network, for voltages and currents are the basic values of components. Once you got the U (Voltage) and I (current) of a component, it’s easy for you to know how the component works. There are many different techniques for calculating these values. However, for the most part, the applied technique assumes that the components of the network are all linear. Not like something inside the electromagnetic field whose U-I relational expression is a function with space and time as variables, components in a linear circuit network is much more lumped and abstract. The foundation of circuit analysis is basically built by 3 people, in the 19th century. 1. Ohm’s Law$$U={R}\\times{I}$$Actually in 1781 Henry Cavendish discovered the above law first but he was unwilling to share it with people, so after Ohm published his result of his work on resistance in 1827, this law was named after him but not the real first discoverer. In my opinion, the Ohm’s Law shows a character of common materials: They “resist” the current running through them. In other words, alomst everything can consume energy, and the ways they consume energy have to obey this rule. And this law is exactly the foundation of everything in linear circuit analysis. By the way, we have to be aware of the reference directions in the circuits. If in your circuit, you assume that the voltage across a component is in the opposite direction with the current running through it, the Ohm’s law should be written as:$$U=-{R}\\times{I}$$ 2. Kirchhoff’s circuit laws KCL: The algebraic sum of currents in a network of conductors meeting at a point is zero.$$\\sum_{k=1}^n I_k=0$$ KVL: The algebraic sum of the products of the resistances of the conductors and the currents in them in a closed loop is equal to the total emf available in that loop.$$\\sum_{k=1}^n U_k=0$$ These laws are actually another ways to express the spirit of the conservation of matter and energy. Using these 2 laws we are capable of solving some more complex circuit problems but not just the basic series circuit or parallel circuit problems. On the basis of these 2 laws, we have the methods of nodal analysis and mesh analysis. Now we can solve every problem of a DC circuit with resistors and dependent source in it. BY THE WAY, sometimes we may find some odd parts in a circuit like these: In this case, we have to simplify the circuit by doing the Y-Δ transform.$$\\begin{aligned} R_y=\\frac{R&apos;R&apos;&apos;}{\\sum{R_{\\Delta}}} \\end{aligned}$$ $$\\begin{aligned} R_\\Delta=\\frac{R_1R_2+R_2R_3+R_3R_1}{R_{opposite}} \\end{aligned}$$ 3. Thévenin’s theoremAs originally stated in terms of DC resistive circuits only, Thévenin’s theorem holds that: Any linear electrical network with voltage and current sources and only resistances can be replaced at terminals A-B by an equivalent voltage source in series connection with an equivalent resistance. This equivalent voltage $U_{oc}$ is the voltage obtained at terminals A-B of the network with terminals A-B open circuited. This equivalent resistance $R_{th}$ is the resistance obtained at terminals A-B of the network with all its independent current sources open circuited and all its independent voltage sources short circuited. Now we can not only solve complex linear circuit analysis problems, but also transform the complex circuits into their simplified “Thevenin” equivalent forms. BY THE WAY, let’s think about how much power we can get from the circuits and how to get the maximum power. Around 1840, Moritz von Jacobi published the maximum power (transfer) theorem: the “Jacobi’s law”. to obtain maximum external power from a source with a finite internal resistance, the resistance of the load must equal the resistance of the source as viewed from its output terminals. So here we get:$$\\begin{aligned} R_{L}=R_{th}\\\\ P_{max}=\\frac{u^{2}_{oc}}{4R_{th}} \\end{aligned}$$ MEANWHILE, sometimes we may find some strange but useful components in our circuits, their U/I are not determined by their own I/U but the I/U of other components. They are dependent sources: VCVS, VCCS, CCVS, CCCS. They are very useful if we want to control the U/I of our target components. However…Resistance is only one of the 3 basic characters of materials. The other 2 characters are capacitance (C) and inductance (L). If we take them into consideration, the U-I relational expressions we get are:$$i(t)=C\\frac{du}{dt}$$and$$u(t)=L\\frac{di}{dt}$$ It’s worth noting that: because of the conservation of matter and energy, the voltage across a capacitor $u_C(t)$ and the current inside a inductor $i_L(t)$ cannot change instantly but can only be changed gradually and continuously. They are the state variables of the circuit. Apparently, these equations are no longer linear. If there is only 1 capacitor or inductor in a DC circuit ( RC circuit or LC circuit ), we can use differential equations to solve them. For example: $y(t)$ means a voltage or current in a circuit. $y(0_+)$ means the initial value. $y(\\infty)$ means the stable value. $\\tau$ is the time constant of the circuit. ( $\\tau=RC$ or $\\tau=\\frac{L}{R}$ ) The point is: we must figure out the 3 elements: $y(0_+)$, $y(\\infty)$ and $\\tau$, so that we can solve the circuit. $$y(t)=y(\\infty)+[y(0_+)-y(\\infty)]e^{-\\frac{t}{\\tau}}$$ MISSION ACCOMPLISHED. However…If there are many capacitors and inductors in a circuit, or the source of the circuit is not DC, it will be very exhausting to deal with it by solving differential equations. How can we solve it in some linear methods?? References: Li,Hansun. Basis of Circuit Analysis, 4th ed. [M]. Beijing: Higher Education Press, 2007. Wikipedia [EB/OL]. https://en.wikipedia.org, 2016-01-24.","categories":[{"name":"EECS","slug":"EECS","permalink":"http://samlyu.github.io/categories/EECS/"},{"name":"Theories","slug":"EECS/Theories","permalink":"http://samlyu.github.io/categories/EECS/Theories/"}],"tags":[{"name":"circuit-analysis","slug":"circuit-analysis","permalink":"http://samlyu.github.io/tags/circuit-analysis/"}]},{"title":"Introduction","slug":"Introduction","date":"2016-01-22T16:00:00.000Z","updated":"2016-08-03T05:19:32.000Z","comments":true,"path":"2016/01/23/Introduction/","link":"","permalink":"http://samlyu.github.io/2016/01/23/Introduction/","excerpt":"","text":"— to me &amp;&amp; my blog. I am the owner of this blog, S. Lyu is my name.Right at this moment (Jan, 2016), I am: A sophomore student. Enrolled in a low-ranked college in suburban Beijing in 2014, after I graduated from a top high school in China and then screwed up the College Entrance Examination. An undergraduate major in electronic engineering. 「circuit-analysis」,「Analog」,「Digital」,「MSP430」… words like these will appear in my posts as tags later. A music lover. I have played piano for the high school chorus and also served as the bassist for our rock band “Groceries”. I would like to share my interest and newly acquired skills with you here. As for me, this blog is: A platform to share knowledge and values. Of course this is what a web log should be. An outlet to speak out my feelings. My surrounding people are quite disparate from those who I used to study with. Most of them are quite kindhearted and easygoing while they have a much lower career expectation. I simply want to do something more for my individual development. Building a blog can be really easy if you choose to use weebly, blogger or some other blog builders, but I choose to build this blog with Github pages and hexo because it really looks cool to have my own domain and I am free to set my site whatever I like it to be. Also, my friend Polaris Chen‘s site (built with Github pages and jekyll) was a motivator for me to build my own site in this way. In a word, I hope you enjoy reading my posts ! References: Chen,Sufeng. How to Build a Blog [EB/OL].http://cnfeat.com/blog/2014/05/10/how-to-build-a-blog/, 2014-05-10. Zippera. Hexo [EB/OL].http://zipperary.com/categories/hexo/, 2015-01-16. Clark,Barry. Build a Blog with Jekyll and GitHub Pages [EB/OL].https://www.smashingmagazine.com/2014/08/build-blog-jekyll-github-pages/, 2014-08-01. Zhang,Ruipeng. Hexo-theme-hueman [EB/OL].https://github.com/ppoffice/hexo-theme-hueman#swiftype Lu,Kang. Mathjax for Hexo [EB/OL].http://lukang.me/2014/mathjax-for-hexo.html, 2014-09-21. Pan,Baixin. Hexo+Github: Build Your Own Blog [EB/OL].http://www.jianshu.com/p/465830080ea9, 2016-07-08. Schrodinger’s Dead Cat. Building a Blog Which Supports LaTeX [EB/OL].http://blog.csdn.net/emptyset110/article/details/50123231, 2015-12-01.","categories":[{"name":"About","slug":"About","permalink":"http://samlyu.github.io/categories/About/"}],"tags":[{"name":"miscellaneous","slug":"miscellaneous","permalink":"http://samlyu.github.io/tags/miscellaneous/"}]}]}